README.md


<a id="org00e458b"></a>

# Assignments

    /* Abbreviations */
      x ⊕= y   ≈  x = x ⊕ y
      x++       ≈  x += 1
      --x      ≈  x -= 1

The increment and decrement, `++/--`, operators may precede or follow a name:

-   If they follow a name, then their behaviour is executed *after* the smallest context
    &#x2014;e.g., braces or conditional parentheses&#x2014; in which they occur.

-   When they precede a name, their behaviour is executed before the context in which
    they appear.

-   The order of evaluation is not specified inside a function call and so behaviour
    varies between compilers.

**Avoid using these in complex expressions, unless you know what you're doing.**


<a id="org526ef7a"></a>

# Loops

Here's the general form.

    while (condition)
      statementBlock

    /* Abbreviations */
    /* for      loop */   for(A; B; C;) S  ≈  A; while(B) S
    /* do-while loop */   do S while B     ≈  S; while(B) S

do/while: The conditional is evaluated *after* the statement has been executed
and so the statement is obeyed at least once, regardless of the truth or falsity of
the condition. This is useful for *do once, and possible more* operations.

    int i = 0;
    do printf("%d \n", i++);
    while (i != 10); //Note the ending semicolon.


<a id="org2329ca9"></a>

# Arithmetic and Logic

> *&#x2026;and then the different branches of arithmetic &#x2014;Ambition, Distraction,
> Uglification, and Derision.*
>
> &#x2014;Alice's Adventures in Wonderland

The modulus operator `%` gives the *remainder* of a division.

    printf("rem = 10 %% 3 = %d  ⇒  ∃ quot •  10 = 3 × quot + rem  ∧  quot = %d", 10 % 3, 10 / 3);

    rem = 10 % 3 = 1  ⇒  ∃ quot •  10 = 3 × quot + rem  ∧  quot = 3

-   In conditionals, one may see `n % d` to mean that `n % d` is true, i.e., is *non-zero*.
    This expresses that `n` is a *multiple* of `d`.

-   That is, numerically `%` yields remainders; but logically, in C, it expresses the
    is-multiple-of relationship.

When `x` is a number, the shift operations correspond to multiplication and
division by `2ⁿ`, respectively.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Left Shift</td>
<td class="org-left">`x << n`</td>
<td class="org-left">append the bit representation of `x` with `n`-many 0s</td>
</tr>


<tr>
<td class="org-left">Right Shift</td>
<td class="org-left">`x >> n`</td>
<td class="org-left">throw away `n` bits from the end of the bit representation of `x`</td>
</tr>
</tbody>
</table>

The *bitwise* operators *and `&`, or `|`, not `!`,* and *xor* `^` operate at the bit representation
of an item. For example, the ASCII code of a character consists of 7 bits where

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><span class="underline">Bit</span></td>
<td class="org-left"><span class="underline">Function</span></td>
</tr>


<tr>
<td class="org-right">7</td>
<td class="org-left">0 digit, 1 letter</td>
</tr>


<tr>
<td class="org-right">6</td>
<td class="org-left">0 upper case, 1 digit or lower case</td>
</tr>


<tr>
<td class="org-right">5</td>
<td class="org-left">0 for a-o, 1 for digit or p-z</td>
</tr>
</tbody>
</table>

Whence, to convert a character to uppercase it suffices to change bit 5 to be a 0
and leave the other bits alone. That is, to perform a bitwise *and* with the binary
number *11011111*, which corresponds to the decimal number 223.

    // Mask, or hide, bit  6 to be a ‘1’.
    #define toLower(c) (c | (1 << 6))

    #define toUpper(c) (c & 223)

    #define times10(x) ( (x << 1)  +  (x << 3)) // Parens matter!
    // x  ⇒  2·x + 8·x  ⇒  10 · x

How did we know is was 223?

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">0. Ninth bit is on</td>
<td class="org-left">`100000000`</td>
<td class="org-left">`1 << 8`</td>
</tr>


<tr>
<td class="org-left">1. Negate it: Eight ones</td>
<td class="org-left">`11111111`</td>
<td class="org-left">`~(1 << 8)`</td>
</tr>


<tr>
<td class="org-left">2. Sixth bit is on</td>
<td class="org-left">`100000`</td>
<td class="org-left">`1 << 5`</td>
</tr>


<tr>
<td class="org-left">3. Xor them</td>
<td class="org-left">`11011111`</td>
<td class="org-left">`⋯ ^ ⋯`</td>
</tr>


<tr>
<td class="org-left">4. See it as a decimal</td>
<td class="org-left">`223`</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

Ironically, C has no primitive binary printing utility.


<a id="org9dd9f1e"></a>

# Floats & Other Types

-   float: Representing huge numbers to tiny fractions.
-   double: Like float, but greater precision.
-   int: The integers; it has 2 *subtypes*; namely short, long, and unsigned.
    -   Short and long allocate less (half) or more (twice) memory, respectively.
    -   Unsigned means we omit negative numbers, and therefore have twice as many
        non-negative numbers since the sign is no longer a necessary place-holder.
        -   Also useful when negative integers are unreasonable for the current task.

Type aliases: `typedef existingType newName;`

    // A named product: String × ℤ × ℝ   having names  name, age, height.
    struct entry
    {
      char   name[30];
      short  age;
      float  height;
    }; // Note that this is a statement

    // Alias for readability.
    typedef   struct entry   Person;

    int main()
    {                                            // Exponent form for numbers.
      struct entry qasim = {"qasim", 0, 613e-2}; // 613e-2 ⇒ 613 × 10⁻² ⇒ 6.13
      Person q = qasim;
      q.age = 23;

      printf("Hello! My name is %s and I'm %d years old, being %f ft tall",
         q.name, q.age, q.height);
      return 0;
    }

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Hello! My name is qasim and I'm 23 years old</td>
<td class="org-left">being 6.130000 ft tall</td>
</tr>
</tbody>
</table>


<a id="orgedbf9f1"></a>

# Forming Numbers using Octal & Hexadecimal

Numbers that begin with a 0 are interpreted as octal and those beginning with 0x or 0X
are hexadecimal. These forms are obtained from binary by grouping using 3 bits
and 4 bits, respectively. E.g., `129 ≈ 0201 ≈ 0x81` since:

-   129 →⟨binary⟩ 10 000 001 →⟨octal⟩ 2 0 1
-   129 →⟨binary⟩ 1000 0001  →⟨hexadecimal⟩ 8 1

Indeed:

    int x = 129, y = 0201, z = 0x81, zz = 0X81, b = (x == y) && (x == zz);
    printf("%d ≈ %d ≈ %d; %d", x, y, z, b);

    129 ≈ 129 ≈ 129; 1


<a id="org1194d93"></a>

# The Preprocessor

The preprocessor performs alterations to a program *before* it is compiled; e.g.,
the following ensures the replacement of every occurrence of `this(⋯, ⋯)` after it with
whatever `that` is.

    #define this(arg1, arg2)  that

-   All preprocessor commands are preceded by the `#` symbol.

-   One generally defines useful constants or abbreviations this way, and if they have
    a collection of such parameters or utilities in some file, then they can
    *copy-paste* them into the current program file by using `#include` as mentioned
     before.
