README.md


<a id="org0523ffc"></a>

# Pointers

-   A fly is a bug that flies; so a *fly flies*.
-   Likewise, a *pointer points*.

Variables may be used without having values declared!
This is akin to buying the land &#x2014;computer memory&#x2014; but not building the house
&#x2014;assigning a value&#x2014; thereby leaving us with a vacant lot that contains trees, garbage,
and whatever was there before you get there &#x2014;as is the case in C.

    char c;
    int i;
    long x;
    float f;
    double d;

    // Uninitalised ⇒ have random values.

    printf("char   %c\n",c);
    printf("int    %i\n",i);
    printf("long   %l\n",x);
    printf("float  %f\n",f);
    printf("double %d\n",d);

\#RESULTS:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">char</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">int</td>
<td class="org-right">32766</td>
</tr>


<tr>
<td class="org-left">long</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">float</td>
<td class="org-right">0.0</td>
</tr>


<tr>
<td class="org-left">double</td>
<td class="org-right">73896</td>
</tr>
</tbody>
</table>

Rather than being set to 0, variables automatically obtain the random values in memory and
one should always initialise variables upon declaration.

-   The amount of space a variable needs is its *size* in memory.
-   The actual location of the variable in memory is called its *address* &#x2014;just like the
    address on your house or on an ugly vacant lot.

-   In your computer, memory space is measured in bytes.
    -   Not every computer uses the same storage space for its variables.
    -   The `sizeof` keyword tells us how many bytes a variable, or structure, uses up.
        -   Both sizeof(x) and sizeof(int) are valid calls.
    -   This keyword is used primarily for manual allocation of memory for new variables
        we create.

            char c;
            int i;
            long x;
            float f;
            double d;

            // Uninitalised ⇒ have random values.

            printf("char   %i\n",sizeof(c));
            printf("int    %i\n",sizeof(i));
            printf("ℤ      %i\n",sizeof(int));
            printf("long   %i\n",sizeof(x));
            printf("float  %i\n",sizeof(f));
            printf("double %i\n",sizeof(d));

            #define Length 123
            #define Type   char
            Type arr[Length];

            assert( sizeof(arr) == sizeof(Type) * Length );

-   Memory is set aside for variables, even if they're not used.
    -   To avoid hogging up excess memory, programs that need a lot of memory usually
        request it a little at a time using `malloc` &#x2014;‘m’emory ‘alloc’ation.

-   C is a mid-level language that has the capability to examine memory and the variables
    stored there.

-   Why care about *where* variables are located in memory?

    Consider sorting an array of complex data, rather than moving the data itself
    around, it is much cheaper to simply sort an array corresponding to their numeric
    locations in memory.

    -   The variables that hold addresses are called *pointers*.

-   A variable consists of 4 pieces: Name, type, size, and location in memory.

    -   The first two we know, since we write them down.
    -   The third is obtained via the `sizeof` operator.
    -   The fourth is obtained by using the “address of” operator `&`, resulting
        in a pointer. ( One may think of ‘&’ as simply projecting the fourth component
        from a variable structure. )

    *A pointer is a variable that holds a memory address.*

    -   Pointers are represented as numeric locations, but they are not number values.

-   `T*` is denotes pointers of type `T`.
    -   Pointers are declared like any other variable.
    -   Conventionally a declaration looks like `T *t;` &#x2014;the whitespace around the ‘\*’ is
        completely irrelevant&#x2014; as a reminder that the expression `*t` denotes a value of
        type `T`. Huh?

        -   Without ‘\*’, pointers consume and represent memory locations.
        -   With ‘\*’, they denote a value of type `T`.

        Unless you're working with pointers to pointers, you do not want
        to write down `*p = &x`, which sets the *value* at the location of `p` to refer to an *address*.

    // Valid declarations
    int*p;
    int* q;
    int *r;
    int * s;

    printf("p is location %u \n", p);

    char arr[] = "hello";
    p = &arr; p = &arr[0]; p = arr;
    printf("p is location %u \n", p);

    // For arrays, the array name and the address of the array both refer to the address
    // of the zeroth element.
    assert( &arr    == arr );
    assert( &arr[0] == arr );

1.  Here's some useful conversion laws

    -   **\*&-inverses:** `p = &x  ≡  *p = x`
        -   The lhs lives in the land of addresses and locations,
            whereas the rhs lives in the land of values.

    -   **[]&-array:** `arr + i = &arr[i]`

    From these we obtain:

    -   **[]\*-array:** `*(arr + i) = arr[i]`  &#x2014;immediate from the above two laws.
    -   **\*-array:** `*arr = arr[0]`  &#x2014;immediate from the above two laws.
    -   ****\***-array:** `**arr = arr[0][0]` &#x2014;the previous law iterated twice.

Tips:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">✓</td>
<td class="org-left">Pointers must be declared with the asterisk</td>
</tr>


<tr>
<td class="org-left">✓</td>
<td class="org-left">When a pointer is used without its asterisk, it refers to a memory location</td>
</tr>


<tr>
<td class="org-left">✓</td>
<td class="org-left">When a pointer is used with its asterisk, it indirectly refers to a value</td>
</tr>


<tr>
<td class="org-left">✓</td>
<td class="org-left">To assign a pointer a memory location, prefix the other variable with &</td>
</tr>


<tr>
<td class="org-left">✓</td>
<td class="org-left">Pointers are memory addresses and can be displayed as unsigned integers using `%u`</td>
</tr>
</tbody>
</table>


<a id="org66dba11"></a>

## Pointer initialisation

    int a[30], *p;

    // Make p point to the beginning of the array a, since a is itself a pointer to the
    // beginning of the array.
    p = a;

    // Determine the actual machine address of a variable by predicing it with &.
    int fred;
    p = &fred;

    // If we need to know exactly where in the machine C had decidede to allocate space
    // to fred, we need only to print out p; whence & is read “address of”.
    printf("%p", p);

    0x7ffee36348ac

Since the name of an array is itself a pointer to the beginning of an array, we have

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">arr ≈ &arr[0]</td>
</tr>
</tbody>
</table>

    // Find furthest points of ‘int a[N-1]’ that are identical.
    #define N 12
    int a[] = {9,8,1,2,3,4,4,3,2,1,7,6};

    int * p = a, *q = &a[N-1];
    while(*p != *q) p++, q--;

    assert(*p == a[2] && *q == a[9]);

Before C99, function return types could be omitted with the understanding that the
default is `int`. However, `main` still needs its return type. The following works with
many warnings.

    f() {return 9; }
    g() {return 'c'; } // Remember that chars are actually numbers.

    int main() { printf("%d", f() + g()); return 0; }

    108
