CheatSheet.org
* Arrays and Strings and Things
+ C arrays are homogeneous ---all elements are of the same type---
  and their size is static ---one cannot readily change how many elements they contain.
+ ~T name[N]~ ⇒ Declares ~name~ to be an array of type ~T~ consisting of ~N~ elements.
  - In an initialisation, ~N~ may be omitted and is then inferred.
    * E.g., ~int a[] = {2, 4, 6};~
    * E.g., ~T a[N] = {x0, ..., xM}~ for ~M < N~ initialises the first ~M~ elements and the
      remaining ~N - M~ are uninitialised, and may consist of random junk.

+ Array access and modification is done with square brackets: ~arr[int_expression]~
  may be treated as a normal variable wherever it occurs.

:Example:
#+BEGIN_SRC C
// int [] a  ⇒  crashes!

int a [] = {9, 7, 3};
int b[3] = {4, 2, 1};

printf("%d", b[1]);

int c[10] = {3, 22, 9};
printf("\n %d and %d", c[1], c[7]);
#+end_src

#+RESULTS:
|  2 |     |   |
| 22 | and | 0 |

:End:

+ Strings are just single-character arrays.

#+BEGIN_SRC C :includes <assert.h>
char hello  [] = "hello";
char hello1 [] = {'h', 'e', 'l', 'l', 'o', '\0'};
char hello2 [6] = {'h', 'e', 'l', 'l', 'o'}; // Null byte included automatically.

// The null byte is not considered part of the string,
// since it's only a terminating marker.
// As such, it's not counted in the length of the string.

// Strings end in the null byte, 0x00 aka \0;
// that's how C knows where the end of a string is;
// otherwise it'd keep looking for the null byte,
// scanning memory then crashing.

char nope [] = {'h', 'e', 'l', 'l', 'o'}; // Just an array of chars, neither size nor \0 at the end to indicate that this is a string.

// The array name suffices to refer to the whole string,
// no need to mention the brackets.

// Strcmp succeeds when its arguments are different;
// and fails (returning 0) if they're the same.
#define Equal(s,t) assert(strcmp(s, t) == 0);

Equal(hello, "hello")
Equal(hello1, "hello")
Equal(hello2, "hello")

assert(strcmp(nope, "hello")); // different args.

// C stops looking when the null byte is found!

char surprise [] = "surprise! No more, my friend";
assert(strlen(surprise) == 28);

surprise[8] = '\0';
Equal(surprise, "surprise")
#+END_SRC

+ string.h contains the strX functions.

#

+ Multi-dimensional arrays: ~T arr[d1][d2]...[dN]~.

  - Just as chars are numbers, multi-dimensional arrays are plain one-dimensional arrays:
    The multiple-dimension declaration syntax simply tells the compiler how to organise
    the array into (nested) groups and the indexing tells it which (nested) group
    we're interested in working with.

#+BEGIN_SRC C :includes <assert.h>
#define D0 4
#define D1 3
#define D2 2

int arr [D0][D1][D2] = // 4 groups consisting of 3 rows with 2 items in each row
  {
    0, 1, // Items of arr[0][0][]
    2, 3, // Items of arr[0][1][]
    4, 5, // Items of arr[0][2][]

    // Items of arr[1][][]
    6, 7,
    8, 9,
    10, 11,

    // Items of arr[2][][]
    12, 13,
    14, 15,
    16, 17,

    // Items of arr[3][][]
    18, 19,
    20, 21,
    22, 23
  };

// Third group's second row, second item is 15.
assert(arr[2][1][1] == 15); // Note: 2*D0 + 1*D1 + 1*D2 ≈ (+ 8 3 2)

assert(arr[0][1][0] == 2);

int nope[2][1] = {2, 4};
assert( *(nope + 0) == 2);
// assert( *(arr + (3*D0 + 2*D1 + 2*D2)) == 15);

// Anomaly:
// char words [a][b][c]
// ⇒ has a lines, consisting of b words, where each consists of c many characters.

#+END_SRC


#+RESULTS:

#

+ The uppercase letters start at ASCII code 65 and lowercase start at code 97.
+ The compiler sees all characters as numbers.

** Strings, Arrays, and Pointers

   + The idea of a pointer is central to the C programming philosophy.
     - It is pointers to strings, rather than strings themselves, that're passed around
       in a C program.

   + C strings like ~s = "this"~ actually, under the hood, are /null-terminated
     arrays of characters/: The name ~s~ refers to the /address of/ the first character, the ~'t'~,
     with the array being ~'t' → 'h' → 'i' → 's' → 𝟘~, where 𝟘 is /not/ ASCII zero
     ---whose value is 48--- but ASCII /null/ ---i.e., all bits set to 0.

     - Note that null 𝟘 is denoted by ~'\0'~ and has /value/ 0, i.e., false, so
       conditions of the form ~p != '\0'~ are the same as ~p~.

   + /An array name is a pointer to the beginning of the array./
     - Yet, an array name is a constant and you can't do arithmetic with it.

 #+BEGIN_SRC C :exports both
int length(char c[]) // A string is a character array
{
  // While c[l] is not an ASCII null, keep counting until.
  int l = 0;
  while( c[l] ) l++;
  return l;
}

int main()
{
  char str[] = "hello world 0123";
  printf("length(“%s”) = %d", str, length(str));
   return 0;
}
 #+END_SRC

 #+RESULTS:
 : length(“hello world 0123”) = 16

   + ~T *p;~ ⇒ declare ~p~ to be a pointer to elements of type ~T~.
   + ~*p = v~ ⇒ “put the value of ~v~ in the location which ~p~ points to”

 We can now rewrite the length function with even less square brackets.
 #+BEGIN_SRC C  :main no :includes '(\"/Users/musa/CCheatSheet/myassert.h\")
int length(char* c)
{
  char* start = c;
  while( *c ) c++; // Local copy of c is affected.
  return c - start;
}

assert(length("hello world") == 11);
 #+END_SRC

* Input --getting things /into/ the machine

  + ~getchar~ returns the next character input from the keyboard.

#+BEGIN_SRC C :tangle (not-currently-working-with)
#include <stdio.h>

int main()
{
  printf("Please enter a character: ");
  char c = getchar();
  printf("You entered: %c", c);
  printf("\nBye\n");

  return 0;
}
#+END_SRC

Let's extend ~getchar~ to work on buffers of length, say, 20:
#+BEGIN_SRC C :tangle (currently-working-with)
#include <stdio.h>

#define BUFFER_LENGTH 10

int main()
{
  printf("Please enter a string, only first %d chars or newline will be read: \n\t\t",
         BUFFER_LENGTH);
  char cs[BUFFER_LENGTH];
  int keep_reading = 1;
  char * p = cs;
  while(keep_reading && p < cs + BUFFER_LENGTH)
    {*p = getchar(); if (*p == '\n') keep_reading = 0; else p++;}

  ,*p = '\0'; // Strings are a null-terminated arrays of chars.

  printf("\nYou entered: %s", cs);
  printf("\nBye\n");

  return 0;
}
#+END_SRC

* COMMENT Interpreter for C :tool:

  *Adapted* to cater to interactive programs
  from /An Interactive Way to C/ and my init's ~my/org-run-haskell~ which really
  ought to be extracted into its own piece.

#+BEGIN_SRC emacs-lisp :tangle InteractiveWayToC.el
;; Every source block is in ‘focus’ when the variables ~NAME~ and ~NAMECode~ refer to it.

(cl-defun currently-working-with (&optional (name (file-name-sans-extension (buffer-name))))
  "Provide the name (without extension) of the source block's resulting file.
   The name is then tied to the “NAMECode” global variable utilised
   by the “show-code” method, <f7>, and the “interpret” command's global variable “NAME”.

   If no argument is provided, we use “⟪BufferName⟫.c” as default file name.
  "
  (setq NAME name)
  (setq NAMECode (concat name ".c"))
)

(defun not-currently-working-with (&optional name)
  "When “:tangle fn” has “fn” being the empty string, the tangle does not transpire.
   As such, it is as if we are not actually generating the source block.

   This operation only returns the empty string and does not alter any existing state.
   If we alter state, then earlier invocations to (currently-working-with) are rendered
   useless!
  "

  ""   ;; Our return value.
)

(defun interpret () "Execute focused source blocks in a new buffer."
  (interactive)
  (save-buffer)
  (org-babel-tangle)

  (let ((buf (concat "*Interactive Way to C* " NAME))
       (kill-buffer-query-functions nil))

    (ignore-errors (kill-buffer buf))
    (async-shell-command
    (concat
     "cd " default-directory "; NAME=" NAME " ; gcc $NAME.c -o $NAME.exe ; ./$NAME.exe")
    buf)
  )
  ;; (insert-focused-name)
  ;; Go back to the literate buffer.
  (other-window 1))

(local-set-key (kbd "<f6>") 'interpret)
#+END_SRC

#+RESULTS:
: interpret

  Example use; press ~f6~.
  #+BEGIN_SRC C :tangle (not-currently-working-with)
#include <stdio.h>

int main() {printf("Hello"); return 0; }
#+END_SRC

*Remember*: All ~currently-working-with~ tagged blocks are interpreted; usually
you want to turn some of these off via ~not-currently-working-with~.

* COMMENT Example code

  #+begin_src C++ :includes <stdio.h>
  int a=1;
  int b=1;
  printf("%d\n", a+b);
#+end_src

#+RESULTS:
: 2

  #+BEGIN_SRC C
  double pi = 4*atan(1);
  double r, theta, phi;
  r = sqrt(x*x+y*y+z*z);
  theta = acos(z/r) * 180.0/pi;
  phi = atan2(y,x) * 180.0/pi;
  printf("%f %f %f", r, theta, phi);
  #+END_SRC

  #+RESULTS:

#+BEGIN_SRC C :main main
int f(){ return 3;}

int main () { printf("%d", f()); return 0;}
#+END_SRC
* COMMENT Making README.md

C-c C-c: Evaluate src block.

#+NAME: make-readme
#+BEGIN_SRC emacs-lisp
(with-temp-buffer
    (insert
    "#+EXPORT_FILE_NAME: README.md
     ,#+HTML: <h1> Easily Making CheatSheets with Org-mode </h1>
     ,#+OPTIONS: toc:nil d:nil
     # Toc is displayed below at a strategic position.

     {{{blurb}}}

    ,*The listing sheet, as PDF, can be found
     [here](CheatSheet.pdf)*,
     while below is an unruly html rendition.

     This reference sheet is built around the system
     https://github.com/alhassy/CheatSheet.

     ,#+TOC: headlines 2
     ,#+INCLUDE: CheatSheet.org
    ")

    ;; No code execution on export
    ;; ⟪ For a particular block, we use “:eval never-export” ⟫
    ;;
    (let ((org-export-use-babel nil))
      (org-mode)
      (org-md-export-to-markdown))
)
#+END_SRC

#+RESULTS: make-readme
: README.md

#+RESULTS:
: README.md

