README.md


<a id="org9d91507"></a>

# Arrays and Strings and Things

-   C arrays are homogeneous &#x2014;all elements are of the same type&#x2014;
    and their size is static &#x2014;one cannot readily change how many elements they contain.
-   `T name[N]` ⇒ Declares `name` to be an array of type `T` consisting of `N` elements.
    -   In an initialisation, `N` may be omitted and is then inferred.
        -   E.g., `int a[] = {2, 4, 6};`
        -   E.g., `T a[N] = {x0, ..., xM}` for `M < N` initialises the first `M` elements and the
            remaining `N - M` are uninitialised, and may consist of random junk.

-   Array access and modification is done with square brackets: `arr[int_expression]`
    may be treated as a normal variable wherever it occurs.

-   Strings are just single-character arrays.

    char hello  [] = "hello";
    char hello1 [] = {'h', 'e', 'l', 'l', 'o', '\0'};
    char hello2 [6] = {'h', 'e', 'l', 'l', 'o'}; // Null byte included automatically.

    // The null byte is not considered part of the string,
    // since it's only a terminating marker.
    // As such, it's not counted in the length of the string.

    // Strings end in the null byte, 0x00 aka \0;
    // that's how C knows where the end of a string is;
    // otherwise it'd keep looking for the null byte,
    // scanning memory then crashing.

    char nope [] = {'h', 'e', 'l', 'l', 'o'}; // Just an array of chars, neither size nor \0 at the end to indicate that this is a string.

    // The array name suffices to refer to the whole string,
    // no need to mention the brackets.

    // Strcmp succeeds when its arguments are different;
    // and fails (returning 0) if they're the same.
    #define Equal(s,t) assert(strcmp(s, t) == 0);

    Equal(hello, "hello")
    Equal(hello1, "hello")
    Equal(hello2, "hello")

    assert(strcmp(nope, "hello")); // different args.

    // C stops looking when the null byte is found!

    char surprise [] = "surprise! No more, my friend";
    assert(strlen(surprise) == 28);

    surprise[8] = '\0';
    Equal(surprise, "surprise")

-   string.h contains the strX functions.

-   Multi-dimensional arrays: `T arr[d1][d2]...[dN]`.
    -   Just as chars are numbers, multi-dimensional arrays are plain one-dimensional arrays:
        The multiple-dimension declaration syntax simply tells the compiler how to organise
        the array into (nested) groups and the indexing tells it which (nested) group
        we're interested in working with.

    #define D0 4
    #define D1 3
    #define D2 2

    int arr [D0][D1][D2] = // 4 groups consisting of 3 rows with 2 items in each row
      {
        0, 1, // Items of arr[0][0][]
        2, 3, // Items of arr[0][1][]
        4, 5, // Items of arr[0][2][]

        // Items of arr[1][][]
        6, 7,
        8, 9,
        10, 11,

        // Items of arr[2][][]
        12, 13,
        14, 15,
        16, 17,

        // Items of arr[3][][]
        18, 19,
        20, 21,
        22, 23
      };

    // Third group's second row, second item is 15.
    assert(arr[2][1][1] == 15); // Note: 2*D0 + 1*D1 + 1*D2 ≈ (+ 8 3 2)

    assert(arr[0][1][0] == 2);

    int nope[2][1] = {2, 4};
    assert( *(nope + 0) == 2);
    // assert( *(arr + (3*D0 + 2*D1 + 2*D2)) == 15);

    // Anomaly:
    // char words [a][b][c]
    // ⇒ has a lines, consisting of b words, where each consists of c many characters.

-   The uppercase letters start at ASCII code 65 and lowercase start at code 97.
-   The compiler sees all characters as numbers.


<a id="org67c7e71"></a>

## Strings, Arrays, and Pointers

-   The idea of a pointer is central to the C programming philosophy.
    -   It is pointers to strings, rather than strings themselves, that're passed around
        in a C program.

-   C strings like `s = "this"` actually, under the hood, are *null-terminated
    arrays of characters*: The name `s` refers to the *address of* the first character, the `'t'`,
    with the array being `'t' → 'h' → 'i' → 's' → 𝟘`, where 𝟘 is *not* ASCII zero
    &#x2014;whose value is 48&#x2014; but ASCII *null* &#x2014;i.e., all bits set to 0.
    -   Note that null 𝟘 is denoted by `'\0'` and has *value* 0, i.e., false, so
        conditions of the form `p != '\0'` are the same as `p`.

-   *An array name is a pointer to the beginning of the array.*
    -   Yet, an array name is a constant and you can't do arithmetic with it.

    int length(char c[]) // A string is a character array
    {
      // While c[l] is not an ASCII null, keep counting until.
      int l = 0;
      while( c[l] ) l++;
      return l;
    }

    int main()
    {
      char str[] = "hello world 0123";
      printf("length(“%s”) = %d", str, length(str));
       return 0;
    }

    length(“hello world 0123”) = 16

-   `T *p;` ⇒ declare `p` to be a pointer to elements of type `T`.
-   `*p = v` ⇒ “put the value of `v` in the location which `p` points to”

We can now rewrite the length function with even less square brackets.

    int length(char* c)
    {
      char* start = c;
      while( *c ) c++; // Local copy of c is affected.
      return c - start;
    }

    assert(length("hello world") == 11);


<a id="orgaf270dd"></a>

# Input &#x2013;getting things *into* the machine

-   `getchar` returns the next character input from the keyboard.

    #include <stdio.h>

    int main()
    {
      printf("Please enter a character: ");
      char c = getchar();
      printf("You entered: %c", c);
      printf("\nBye\n");

      return 0;
    }

Let's extend `getchar` to work on buffers of length, say, 20:

    #include <stdio.h>

    #define BUFFER_LENGTH 10

    int main()
    {
      printf("Please enter a string, only first %d chars or newline will be read: \n\t\t",
             BUFFER_LENGTH);
      char cs[BUFFER_LENGTH];
      int keep_reading = 1;
      char * p = cs;
      while(keep_reading && p < cs + BUFFER_LENGTH)
        {*p = getchar(); if (*p == '\n') keep_reading = 0; else p++;}

      *p = '\0'; // Strings are a null-terminated arrays of chars.

      printf("\nYou entered: %s", cs);
      printf("\nBye\n");

      return 0;
    }
